Revit 2027 API
Alignment.GetVCurveTangentAtStation Method
 Calculate 2d (X and Y components of returned vector) vertical tangent at given station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetVCurveTangentAtStation(
	double station
)
Public Function GetVCurveTangentAtStation (
	station As Double
) As XYZ
public:
XYZ^ GetVCurveTangentAtStation(
	double station
)
member GetVCurveTangentAtStation :
        station : float -> XYZ
Parameters
station Double
Alignment station to calculate 2d vertical tangent for, in Revit internal model units (standard Imperial feet).
Return Value
XYZ
2d (X and Y components of returned vector) vertical tangent at given station.
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace